[
  {
    "text": "Non-profit software organizations include the Free Software Foundation, GNU Project and Mozilla Foundation. Software standard organizations like the W3C, IETF develop recommended software standards such as XML, HTTP and HTML, so that software can interoperate through these standards.",
    "additionalProperty": 1
  },
  {
    "text": "Other well-known large software companies include Google, IBM, TCS, Infosys, Wipro, HCL Technologies, Oracle, Novell, SAP, Symantec, Adobe Systems, Sidetrade and Corel, while small companies often provide innovation.",
    "additionalProperty": 1
  },
  {
    "text": "A 1919 banknote of the short-lived Yugoslav krone currency, which replaced the Austro-Hungarian krone at par in 1918 and was used for a few years alongside the Yugoslav dinar in the Kingdom of Serbs, Croats, and Slovenes. This picture shows a 400 kronen note which is overprinted on a 100 dinara note.",
    "additionalProperty": 1
  },
  {
    "text": "The coats of domestic dogs are of two varieties: \"double\" being common with dogs (as well as wolves) originating from colder climates, made up of a coarse guard hair and a soft down hair, or \"single\", with the topcoat only.",
    "additionalProperty": 1
  },
  {
    "text": "Domestic dogs often display the remnants of countershading, a common natural camouflage pattern. A countershaded animal will have dark coloring on its upper surfaces and light coloring below,",
    "additionalProperty": 1
  },
  {
    "text": "There are many different shapes for dog tails: straight, straight up, sickle, curled, or cork-screw. As with many canids, one of the primary functions of a dog's tail is to communicate their emotional state, which can be important in getting along with others. In some hunting dogs, however, the tail is traditionally docked to avoid injuries.",
    "additionalProperty": 1
  },
  {
    "text": "Dogs are also vulnerable to some of the same health conditions as humans, including diabetes, dental and heart disease, epilepsy, cancer, hypothyroidism, and arthritis.",
    "additionalProperty": 1
  },
  {
    "text": "In 2013, a study found that mixed breeds live on average 1.2 years longer than pure breeds, and that increasing body-weight was negatively correlated with longevity (i.e. the heavier the dog the shorter its lifespan).",
    "additionalProperty": 1
  },
  {
    "text": "The typical lifespan of dogs varies widely among breeds, but for most the median longevity, the age at which half the dogs in a population have died and half are still alive, ranges from 10 to 13 years. Individual dogs may live well beyond the median of their breed.",
    "additionalProperty": 1
  },
  {
    "text": "The breed with the shortest lifespan (among breeds for which there is a questionnaire survey with a reasonable sample size) is the dogue de Bordeaux, with a median longevity of about 5.2 years, but several breeds, including miniature bull terriers, bloodhounds, and Irish wolfhounds are nearly as short-lived, with median longevities of 6 to 7 years.",
    "additionalProperty": 1
  },
  {
    "text": "The longest-lived breeds, including toy poodles, Japanese spitz, Border terriers, and Tibetan spaniels, have median longevities of 14 to 15 years.",
    "additionalProperty": 1
  },
  {
    "text": "Fertilization typically occurs 2–5 days after ovulation; 14–16 days after ovulation, the embryo attaches to the uterus, and after 7-8 more days the heart beat is detectable.",
    "additionalProperty": 1
  },
  {
    "text": "Dogs bear their litters roughly 58 to 68 days after fertilization, though this number may vary widely based on the breed of dog. In general, toy dogs produce from one to four puppies in each litter, while much larger breeds may average as many as twelve.",
    "additionalProperty": 1
  },
  {
    "text": "Some dog breeds have acquired traits through selective breeding that interfere with reproduction. Male French Bulldogs, for instance, are incapable of mounting the female. For many dogs of this breed, the female must be artificially inseminated in order to reproduce.",
    "additionalProperty": 1
  },
  {
    "text": "Neutering refers to the sterilization of animals, usually by removal of the male's testicles or the female's ovaries and uterus, in order to eliminate the ability to procreate and reduce sex drive. Because of the overpopulation of dogs in some countries, many animal control agencies, such as the American Society for the Prevention of Cruelty to Animals (ASPCA), advise that dogs not intended for further breeding should be neutered, so that they do not have undesired puppies that may later be euthanized.",
    "additionalProperty": 1
  },
  {
    "text": "According to the Humane Society of the United States, 3–4 million dogs and cats are euthanized each year in the United States and many more are confined to cages in shelters because there are many more animals than there are homes. Spaying or castrating dogs helps keep overpopulation down. Local humane societies, SPCAs, and other animal protection organizations urge people to neuter their pets and to adopt animals from shelters instead of purchasing them.",
    "additionalProperty": 1
  },
  {
    "text": "Neutering reduces problems caused by hypersexuality, especially in male dogs.",
    "additionalProperty": 1
  },
  {
    "text": "A common breeding practice for pet dogs is mating between close relatives (e.g. between half- and full siblings).",
    "additionalProperty": 1
  },
  {
    "text": "Dog communication is about how dogs convey information to other dogs, how they understand messages from humans, and how humans translate the information that dogs are transmitting.:xii Communication behaviors of dogs include eye gaze, facial expression, vocalization, body posture (including movements of bodies and limbs) and gustatory communication (scents, pheromones and taste). Humans communicate to dogs by using vocalization, hand signals and body posture.",
    "additionalProperty": 1
  }
]
